emacs_ebib.org
#+title: Emacs - Ebib

[[https://github.com/joostkremers/ebib][Ebib]] is a tool inside Emacs for bibliography management, supporting /BibTeX/ and /biblatex/ files. This post is just a brief summary of the online [[https://joostkremers.github.io/ebib/ebib-manual.html][manual]].

* Installation
Ebib can be easily installed via [[http://melpa.org][Melpa]].
* View
When ebib is started, the Emacs frame is divided into 2 windows, /index buffer/ at the top and /entry buffer/ at the bottom.
** Index buffer
All the entries are listed in this buffer.
- The fields or columns displayed in the buffer can be [[*Columns in index buffer][customized]].
- The entries are by default sorted in ascending order on the first column defined in =ebib-index-columns=, but the sorting rule can be specified by option [[*Sort columns displayed in index buffer][ebib-index-default-sort]].
** Entry buffer
All the fields of the selected entry are shown in this buffer. The first field is =type= field, as the name indicates, it indicates the type of the entry, e.g., =article=, =book=. Besides, the remaining fields can be classified into 4 groups below. =Required fields= and =optional fields= are =type=-specific; while =extra fields= and =undefined fields= are not, but defined globally.
- =Required fields=: Required by BibTeX/biblatex.
- =Optional fields=
- =Extra fields=: Usually ignored by BibTeX/biblatex.
- =Undefined fields=
* Configuration
** Start
Ebib can be started by running command =M-x ebib= inside Emacs. Optionally, it can be bound to a keyboard shortcut, e.g., adding the new line below to =~/.config/emacs/init.el=.
#+begin_src elisp
  (global-set-key (kbd "C-c e") 'ebib)
#+end_src
** Columns in index buffer
#+begin_src elisp
  (setq ebib-index-columns '(("Year" 6 t)
                             ("Author/Editor" 40 t)
                             ("Title" 50 t)))
#+end_src
** Sort columns displayed in index buffer
#+begin_src elisp
  (setq ebib-index-default-sort '("Year" . descend))
#+end_src
** Sort entries in a bib file[fn:2]
#+begin_src elisp
  (setq ebib-sort-order '(year author))
#+end_src
** Dialect
Ebib supports two dialects, BibTeX and biblatex. The default dialect is BibTeX, but can be changed to biblatex, i.e.,
#+begin_src elisp
  (setq ebib-bibtex-dialect 'biblatex)
#+end_src
** Generate key
- If =ebib-autogenerate-keys= is set to =t=, function =bibtex-generate-autokey= will automatically generate the key for the entry.
- If =ebib-autogenerate-keys= is set to =nil=, the key can be manually specified.
** Enable multiple citations
#+begin_src elisp
  (setq ebib-citations-insert-multiple t)
#+end_src
** File search directories
For an entry with field =file=, ebib searches and opens it in a series of directories, i.e., =File Search Dirs=.
#+begin_src elisp
  (setq ebib-file-search-dirs '("~/ref/data"))
#+end_src
** File association
Ebib opens different types of files, i.e., extensions of files, using different external programs.
#+begin_src elisp
  (setq ebib-file-associations '(("pdf" . "okular")))
#+end_src
** Notes
- One file per note (default) :: The default note file name is the entry key appended with a =.org= extension. But the naming rule can be customized by option =ebib-notes-name-transform-function=. Otherwise, =ebib-name-transform-function= will be used.
  #+begin_src elisp
    (setq ebib-notes-storage 'one-file-per-note)
    (setq ebib-notes-directory "~/ref/note")
  #+end_src
- Multiple notes per file :: Optionally, a default note file can be designated for new notes by option =ebib-notes-default-file=.
  #+begin_src elisp
    (setq ebib-notes-storage 'multiple-notes-per-file)
    (setq ebib-notes-locations ("~/ref/note"))
  #+end_src
** Reading list
=Reading list= is an Org file, which records the state of an entry, e.g.,
- =TODO= for an entry to read
- =DONE= for an entry read already
#+begin_src elisp
  (setq ebib-reading-list-file "~/ref/read.org")
#+end_src
** Keyword
Ebib supports keywords by entry field =keywords=. Optionally, a canonical keywords list can be defined, e.g.,
#+begin_src elisp
  (setq ebib-keywords '("mimo" "ofdm"))
#+end_src
** Layout
Ebib has 4 layout options.
- Use the full frame (default)
- Use the current window
- Use the right part of the frame
  + Ebib can be sent to background by pressing =Z= instead of =z=.
  + Multiline edit buffer is not displayed.
- Display the index window only
  + The entry buffer does not appear by default, but can be displayed only when an entry is added or edited.
  + =RET= can display the entry buffer by force.
