emacs_ebib.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-01-28 Sat 01:49 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs - Ebib</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs - Ebib</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7b97d6e">Installation</a></li>
<li><a href="#org092e566">View</a>
<ul>
<li><a href="#org353898e">Index buffer</a></li>
<li><a href="#orgaa31e40">Entry buffer</a></li>
</ul>
</li>
<li><a href="#orgea2e90c">Configuration</a>
<ul>
<li><a href="#org329f70e">Start</a></li>
<li><a href="#org4e9ebb9">Columns in index buffer</a></li>
<li><a href="#org5daa4a6">Sort columns displayed in index buffer</a></li>
<li><a href="#orga5afb21">Sort entries in a bib file</a></li>
<li><a href="#orgf219ace">Dialect</a></li>
<li><a href="#orgb737f8a">Generate key</a></li>
<li><a href="#orgda9bb7e">Enable multiple citations</a></li>
<li><a href="#orgb1a8279">File search directories</a></li>
<li><a href="#org9900195">File association</a></li>
<li><a href="#org048b96f">Notes</a></li>
<li><a href="#org1afbeab">Reading list</a></li>
<li><a href="#orged1c4a9">Keyword</a></li>
<li><a href="#org28f43ca">Layout</a></li>
<li><a href="#org55c1183">Example</a></li>
</ul>
</li>
<li><a href="#orgf16672c">Usage</a>
<ul>
<li><a href="#orge1d259b">In index buffer</a>
<ul>
<li><a href="#orgb520a67">Database</a>
<ul>
<li><a href="#orgae54ff7">Import entries</a>
<ul>
<li><a href="#orgf127cce">From a buffer</a></li>
<li><a href="#org4d29231">With biblio package</a></li>
</ul>
</li>
<li><a href="#org8b6f5b2">Print</a>
<ul>
<li><a href="#org7195439">As a bibliography</a></li>
<li><a href="#orgb368912">As index cards</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc5efa42">Navigate entries</a></li>
<li><a href="#orgfcadb27">View entries</a></li>
<li><a href="#org13b4fa8">Sort entries</a></li>
<li><a href="#orgd3a4a3b">Search/filter entries</a></li>
<li><a href="#org8d9b78a">Edit entries</a></li>
<li><a href="#org7084d78">Reading list</a></li>
</ul>
</li>
<li><a href="#orgde14250">In entry buffer</a>
<ul>
<li><a href="#org37f64c3">Navigate fields</a></li>
<li><a href="#org0b243e1">Edit fields</a></li>
</ul>
</li>
<li><a href="#orgeccaee6">In string buffer</a></li>
<li><a href="#org5cb7410">Insert citations into a text buffer</a></li>
<li><a href="#org84f80f8">Link to external resources</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/joostkremers/ebib">Ebib</a> is a tool inside Emacs for bibliography management, supporting <i>BibTeX</i> and <i>biblatex</i> files. This post is just a brief summary of the online <a href="https://joostkremers.github.io/ebib/ebib-manual.html">manual</a>.
</p>

<div id="outline-container-org7b97d6e" class="outline-2">
<h2 id="org7b97d6e">Installation</h2>
<div class="outline-text-2" id="text-org7b97d6e">
<p>
Ebib can be easily installed via <a href="http://melpa.org">Melpa</a>.
</p>
</div>
</div>
<div id="outline-container-org092e566" class="outline-2">
<h2 id="org092e566">View</h2>
<div class="outline-text-2" id="text-org092e566">
<p>
When ebib is started, the Emacs frame is divided into 2 windows, <i>index buffer</i> at the top and <i>entry buffer</i> at the bottom.
</p>
</div>
<div id="outline-container-org353898e" class="outline-3">
<h3 id="org353898e">Index buffer</h3>
<div class="outline-text-3" id="text-org353898e">
<p>
All the entries are listed in this buffer.
</p>
<ul class="org-ul">
<li>The fields or columns displayed in the buffer can be <a href="#org4e9ebb9">customized</a>.</li>
<li>The entries are by default sorted in ascending order on the first column defined in <code>ebib-index-columns</code>, but the sorting rule can be specified by option <a href="#org5daa4a6">ebib-index-default-sort</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa31e40" class="outline-3">
<h3 id="orgaa31e40">Entry buffer</h3>
<div class="outline-text-3" id="text-orgaa31e40">
<p>
All the fields of the selected entry are shown in this buffer. The first field is <code>type</code> field, as the name indicates, it indicates the type of the entry, e.g., <code>article</code>, <code>book</code>. Besides, the remaining fields can be classified into 4 groups below. <code>Required fields</code> and <code>optional fields</code> are <code>type</code>-specific; while <code>extra fields</code> and <code>undefined fields</code> are not, but defined globally.
</p>
<ul class="org-ul">
<li><code>Required fields</code>: Required by BibTeX/biblatex.</li>
<li><code>Optional fields</code></li>
<li><code>Extra fields</code>: Usually ignored by BibTeX/biblatex.</li>
<li><code>Undefined fields</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgea2e90c" class="outline-2">
<h2 id="orgea2e90c">Configuration</h2>
<div class="outline-text-2" id="text-orgea2e90c">
</div>
<div id="outline-container-org329f70e" class="outline-3">
<h3 id="org329f70e">Start</h3>
<div class="outline-text-3" id="text-org329f70e">
<p>
Ebib can be started by running command <code>M-x ebib</code> inside Emacs. Optionally, it can be bound to a keyboard shortcut, e.g., adding the new line below to <code>~/.config/emacs/init.el</code>.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd "C-c e") 'ebib)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e9ebb9" class="outline-3">
<h3 id="org4e9ebb9">Columns in index buffer</h3>
<div class="outline-text-3" id="text-org4e9ebb9">
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-index-columns '(("Year" 6 t)
                           ("Author/Editor" 40 t)
                           ("Title" 50 t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5daa4a6" class="outline-3">
<h3 id="org5daa4a6">Sort columns displayed in index buffer</h3>
<div class="outline-text-3" id="text-org5daa4a6">
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-index-default-sort '("Year" . descend))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5afb21" class="outline-3">
<h3 id="orga5afb21">Sort entries in a bib file<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></h3>
<div class="outline-text-3" id="text-orga5afb21">
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-sort-order '(year author))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf219ace" class="outline-3">
<h3 id="orgf219ace">Dialect</h3>
<div class="outline-text-3" id="text-orgf219ace">
<p>
Ebib supports two dialects, BibTeX and biblatex. The default dialect is BibTeX, but can be changed to biblatex, i.e.,
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-bibtex-dialect 'biblatex)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb737f8a" class="outline-3">
<h3 id="orgb737f8a">Generate key</h3>
<div class="outline-text-3" id="text-orgb737f8a">
<ul class="org-ul">
<li>If <code>ebib-autogenerate-keys</code> is set to <code>t</code>, function <code>bibtex-generate-autokey</code> will automatically generate the key for the entry.</li>
<li>If <code>ebib-autogenerate-keys</code> is set to <code>nil</code>, the key can be manually specified.</li>
</ul>
</div>
</div>
<div id="outline-container-orgda9bb7e" class="outline-3">
<h3 id="orgda9bb7e">Enable multiple citations</h3>
<div class="outline-text-3" id="text-orgda9bb7e">
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-citations-insert-multiple t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1a8279" class="outline-3">
<h3 id="orgb1a8279">File search directories</h3>
<div class="outline-text-3" id="text-orgb1a8279">
<p>
For an entry with field <code>file</code>, ebib searches and opens it in a series of directories, i.e., <code>File Search Dirs</code>.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-file-search-dirs '("~/ref/data"))
</pre>
</div>
</div>
</div>
<div id="outline-container-org9900195" class="outline-3">
<h3 id="org9900195">File association</h3>
<div class="outline-text-3" id="text-org9900195">
<p>
Ebib opens different types of files, i.e., extensions of files, using different external programs.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-file-associations '(("pdf" . "okular")))
</pre>
</div>
</div>
</div>
<div id="outline-container-org048b96f" class="outline-3">
<h3 id="org048b96f">Notes</h3>
<div class="outline-text-3" id="text-org048b96f">
<dl class="org-dl">
<dt>One file per note (default)</dt><dd><p>
The default note file name is the entry key appended with a <code>.org</code> extension. But the naming rule can be customized by option <code>ebib-notes-name-transform-function</code>. Otherwise, <code>ebib-name-transform-function</code> will be used.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-notes-storage 'one-file-per-note)
(setq ebib-notes-directory "~/ref/note")
</pre>
</div></dd>
<dt>Multiple notes per file</dt><dd><p>
Optionally, a default note file can be designated for new notes by option <code>ebib-notes-default-file</code>.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-notes-storage 'multiple-notes-per-file)
(setq ebib-notes-locations ("~/ref/note"))
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-org1afbeab" class="outline-3">
<h3 id="org1afbeab">Reading list</h3>
<div class="outline-text-3" id="text-org1afbeab">
<p>
<code>Reading list</code> is an Org file, which records the state of an entry, e.g.,
</p>
<ul class="org-ul">
<li><code>TODO</code> for an entry to read</li>
<li><code>DONE</code> for an entry read already</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-reading-list-file "~/ref/read.org")
</pre>
</div>
</div>
</div>
<div id="outline-container-orged1c4a9" class="outline-3">
<h3 id="orged1c4a9">Keyword</h3>
<div class="outline-text-3" id="text-orged1c4a9">
<p>
Ebib supports keywords by entry field <code>keywords</code>. Optionally, a canonical keywords list can be defined, e.g.,
</p>
<div class="org-src-container">
<pre class="src src-elisp">(setq ebib-keywords '("mimo" "ofdm"))
</pre>
</div>
</div>
</div>
<div id="outline-container-org28f43ca" class="outline-3">
<h3 id="org28f43ca">Layout</h3>
<div class="outline-text-3" id="text-org28f43ca">
<p>
Ebib has 4 layout options.
</p>
<ul class="org-ul">
<li>Use the full frame (default)</li>
<li>Use the current window</li>
<li>Use the right part of the frame
<ul class="org-ul">
<li>Ebib can be sent to background by pressing <code>Z</code> instead of <code>z</code>.</li>
<li>Multiline edit buffer is not displayed.</li>
</ul></li>
<li>Display the index window only
<ul class="org-ul">
<li>The entry buffer does not appear by default, but can be displayed only when an entry is added or edited.</li>
<li><code>RET</code> can display the entry buffer by force.</li>
</ul></li>
</ul>
</div>
</div>
