emacs_ebib.org
** Example
#+begin_src elisp
  (use-package ebib
    :custom
    (ebib-preload-bib-files '("~/ref/ref.bib"))
    (ebib-index-columns '(("Year" 6 t)
                          ("Author/Editor" 40 t)
                          ("Title" 50 t)))
    (ebib-index-default-sort '("timestamp" . descend))
    (ebib-sort-order '(year author))
    (ebib-bibtex-dialect 'biblatex)
    (ebib-citations-insert-multiple t)
    (ebib-file-search-dirs '("~/ref/data"))
    (ebib-file-associations '(("pdf" . "okular")))
    (ebib-notes-storage 'one-file-per-note)
    (ebib-notes-directory "~/ref/note")
    (ebib-reading-list-file "~/ref/read.org")
    (ebib-keywords '("mimo" "ofdm"))
    (ebib-autogenerate-keys t)
    (bibtex-autokey-year-title-separator ":")
    (bibtex-autokey-year-length 4))
  (use-package ebib-biblio
    :ensure biblio
    :after (ebib biblio)
    :custom
    (biblio-download-directory "~/ref/data")
    (biblio-bibtex-use-autokey 1))
#+end_src
* Usage
** In index buffer
*** Database
| Shortcut              | Functionality                                       |
|-----------------------+-----------------------------------------------------|
| =q=                   | Quit ebib.                                          |
| =z=                   | Put ebib in the background.                         |
| =o=                   | Open an existing or create a new bib file.          |
| =c=                   | Close a opened bib file.                            |
| =s=                   | Save the current database to the original bib file. |
| =w=                   | Save the current database to another bib file.      |
| =1-9=                 | Switch to opened bib file indexed[fn:1] by 1-9.     |
| =Left=                | Switch to previous database.                        |
| =Right=               | Switch to next database.                            |
| =P=                   | Create or edit a =@Preamble= definition.            |
| =S=                   | Replace the entry buffer with string buffer.        |
| =M c=                 | Create a =dependent database=[fn:4].                |
| =M a=                 | Push entries to a =dependent database=.             |
**** Import entries
***** From a buffer
| Function              | Functionality                                       |
|-----------------------+-----------------------------------------------------|
| =ebib-import-entries= | Load all entries found in the active buffer/region. |
***** With [[https://github.com/cpitclaudel/biblio.el][biblio]] package
#+begin_src elisp
  (use-package ebib-biblio
    :ensure biblio
    :after (ebib biblio))
#+end_src
| Function                       | Functionality                                                    |
|--------------------------------+------------------------------------------------------------------|
| =biblio-lookup=                | Fetch entries from arXiv, CrossRef, DBLP, HAL, IEEE Xplore, etc. |
| =ebib-biblio-selection-import= | Import the current entry in the =biblio.el= selection buffer.    |
| =B= / =ebib-biblio-import-doi= | Fetch entries based on doi.                                      |
**** Print
***** As a bibliography
Ebib creates a simple LaTeX document essentially consisting of 3 commands below.
- =\nocite{*}=
- =\printbibliography=
- =\addbibresource=
***** As index cards
Ebib creates a LaTeX file in which a =tabular= environment is created for each entry including all the fields.
*** Navigate entries
| Shortcut                   | Functionality                                                            |
|----------------------------+--------------------------------------------------------------------------|
| =p= / =C-p=                | Move one entry up.                                                       |
| =n= / =C-n=                | Move one entry down.                                                     |
| =Space=                    | Move one page down.                                                      |
| =b=                        | Move one page up.                                                        |
| =g=                        | Move to the first entry.                                                 |
| =G=                        | Move to the last entry.                                                  |
| =j= / =ebib-jump-to-entry= | Jump to an entry in all open databases.                                  |
| =C-u j=                    | Jump to an entry in the current database.                                |
| =C=                        | For an entry without =crossref= field, jump to its parent/child entries. |
*** View entries
| Shortcut | Functionality                                                                                       |
|----------+-----------------------------------------------------------------------------------------------------|
| =f=      | Open the file specfied in field =file=.                                                             |
| =u=      | Open the URL specfied in field =url= with default browser.                                          |
| =I=      | Send the DOI of the current entry (may be prepended with =https://dx.doi.org/=) to default browser. |
| =N=      | Create a new note for the entry.                                                                    |
*** Sort entries
| Shortcut | Functionality                     |
|----------+-----------------------------------|
| =<=      | Sort entries in asending order.   |
| =>=      | Sort entries in descending order. |
| ===      | Resort the default sorting order. |
