emacs_ebib.html
<div id="outline-container-org55c1183" class="outline-3">
<h3 id="org55c1183">Example</h3>
<div class="outline-text-3" id="text-org55c1183">
<div class="org-src-container">
<pre class="src src-elisp">(use-package ebib
  :custom
  (ebib-preload-bib-files '("~/ref/ref.bib"))
  (ebib-index-columns '(("Year" 6 t)
                        ("Author/Editor" 40 t)
                        ("Title" 50 t)))
  (ebib-index-default-sort '("timestamp" . descend))
  (ebib-sort-order '(year author))
  (ebib-bibtex-dialect 'biblatex)
  (ebib-citations-insert-multiple t)
  (ebib-file-search-dirs '("~/ref/data"))
  (ebib-file-associations '(("pdf" . "okular")))
  (ebib-notes-storage 'one-file-per-note)
  (ebib-notes-directory "~/ref/note")
  (ebib-reading-list-file "~/ref/read.org")
  (ebib-keywords '("mimo" "ofdm"))
  (ebib-autogenerate-keys t)
  (bibtex-autokey-year-title-separator ":")
  (bibtex-autokey-year-length 4))
(use-package ebib-biblio
  :ensure biblio
  :after (ebib biblio)
  :custom
  (biblio-download-directory "~/ref/data")
  (biblio-bibtex-use-autokey 1))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf16672c" class="outline-2">
<h2 id="orgf16672c">Usage</h2>
<div class="outline-text-2" id="text-orgf16672c">
</div>
<div id="outline-container-orge1d259b" class="outline-3">
<h3 id="orge1d259b">In index buffer</h3>
<div class="outline-text-3" id="text-orge1d259b">
</div>
<div id="outline-container-orgb520a67" class="outline-4">
<h4 id="orgb520a67">Database</h4>
<div class="outline-text-4" id="text-orgb520a67">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left">Quit ebib.</td>
</tr>

<tr>
<td class="org-left"><code>z</code></td>
<td class="org-left">Put ebib in the background.</td>
</tr>

<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left">Open an existing or create a new bib file.</td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left">Close a opened bib file.</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left">Save the current database to the original bib file.</td>
</tr>

<tr>
<td class="org-left"><code>w</code></td>
<td class="org-left">Save the current database to another bib file.</td>
</tr>

<tr>
<td class="org-left"><code>1-9</code></td>
<td class="org-left">Switch to opened bib file indexed<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> by 1-9.</td>
</tr>

<tr>
<td class="org-left"><code>Left</code></td>
<td class="org-left">Switch to previous database.</td>
</tr>

<tr>
<td class="org-left"><code>Right</code></td>
<td class="org-left">Switch to next database.</td>
</tr>

<tr>
<td class="org-left"><code>P</code></td>
<td class="org-left">Create or edit a <code>@Preamble</code> definition.</td>
</tr>

<tr>
<td class="org-left"><code>S</code></td>
<td class="org-left">Replace the entry buffer with string buffer.</td>
</tr>

<tr>
<td class="org-left"><code>M c</code></td>
<td class="org-left">Create a <code>dependent database</code><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.</td>
</tr>

<tr>
<td class="org-left"><code>M a</code></td>
<td class="org-left">Push entries to a <code>dependent database</code>.</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgae54ff7" class="outline-5">
<h5 id="orgae54ff7">Import entries</h5>
<div class="outline-text-5" id="text-orgae54ff7">
</div>
<div id="outline-container-orgf127cce" class="outline-6">
<h6 id="orgf127cce">From a buffer</h6>
<div class="outline-text-6" id="text-orgf127cce">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>ebib-import-entries</code></td>
<td class="org-left">Load all entries found in the active buffer/region.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4d29231" class="outline-6">
<h6 id="org4d29231">With <a href="https://github.com/cpitclaudel/biblio.el">biblio</a> package</h6>
<div class="outline-text-6" id="text-org4d29231">
<div class="org-src-container">
<pre class="src src-elisp">(use-package ebib-biblio
  :ensure biblio
  :after (ebib biblio))
</pre>
</div>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>biblio-lookup</code></td>
<td class="org-left">Fetch entries from arXiv, CrossRef, DBLP, HAL, IEEE Xplore, etc.</td>
</tr>

<tr>
<td class="org-left"><code>ebib-biblio-selection-import</code></td>
<td class="org-left">Import the current entry in the <code>biblio.el</code> selection buffer.</td>
</tr>

<tr>
<td class="org-left"><code>B</code> / <code>ebib-biblio-import-doi</code></td>
<td class="org-left">Fetch entries based on doi.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org8b6f5b2" class="outline-5">
<h5 id="org8b6f5b2">Print</h5>
<div class="outline-text-5" id="text-org8b6f5b2">
</div>
<div id="outline-container-org7195439" class="outline-6">
<h6 id="org7195439">As a bibliography</h6>
<div class="outline-text-6" id="text-org7195439">
<p>
Ebib creates a simple LaTeX document essentially consisting of 3 commands below.
</p>
<ul class="org-ul">
<li><code>\nocite{*}</code></li>
<li><code>\printbibliography</code></li>
<li><code>\addbibresource</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgb368912" class="outline-6">
<h6 id="orgb368912">As index cards</h6>
<div class="outline-text-6" id="text-orgb368912">
<p>
Ebib creates a LaTeX file in which a <code>tabular</code> environment is created for each entry including all the fields.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc5efa42" class="outline-4">
<h4 id="orgc5efa42">Navigate entries</h4>
<div class="outline-text-4" id="text-orgc5efa42">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>p</code> / <code>C-p</code></td>
<td class="org-left">Move one entry up.</td>
</tr>

<tr>
<td class="org-left"><code>n</code> / <code>C-n</code></td>
<td class="org-left">Move one entry down.</td>
</tr>

<tr>
<td class="org-left"><code>Space</code></td>
<td class="org-left">Move one page down.</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left">Move one page up.</td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left">Move to the first entry.</td>
</tr>

<tr>
<td class="org-left"><code>G</code></td>
<td class="org-left">Move to the last entry.</td>
</tr>

<tr>
<td class="org-left"><code>j</code> / <code>ebib-jump-to-entry</code></td>
<td class="org-left">Jump to an entry in all open databases.</td>
</tr>

<tr>
<td class="org-left"><code>C-u j</code></td>
<td class="org-left">Jump to an entry in the current database.</td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left">For an entry without <code>crossref</code> field, jump to its parent/child entries.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgfcadb27" class="outline-4">
<h4 id="orgfcadb27">View entries</h4>
<div class="outline-text-4" id="text-orgfcadb27">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">Open the file specfied in field <code>file</code>.</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">Open the URL specfied in field <code>url</code> with default browser.</td>
</tr>

<tr>
<td class="org-left"><code>I</code></td>
<td class="org-left">Send the DOI of the current entry (may be prepended with <code>https://dx.doi.org/</code>) to default browser.</td>
</tr>

<tr>
<td class="org-left"><code>N</code></td>
<td class="org-left">Create a new note for the entry.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org13b4fa8" class="outline-4">
<h4 id="org13b4fa8">Sort entries</h4>
<div class="outline-text-4" id="text-org13b4fa8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left">Sort entries in asending order.</td>
</tr>

<tr>
<td class="org-left"><code>&gt;</code></td>
<td class="org-left">Sort entries in descending order.</td>
</tr>

<tr>
<td class="org-left"><code>=</code></td>
<td class="org-left">Resort the default sorting order.</td>
</tr>
</tbody>
</table>
</div>
</div>
