emacs_ebib.org
*** Search/filter entries
| Shortcut            | Functionality                                                            |
|---------------------+--------------------------------------------------------------------------|
| =/= / =ebib-search= | Search for a string or a regular expression from the current entry.      |
| =C-u /=             | Start searching with the string for previous search.                     |
| =&=                 | Create a filter or perform a logical =and= on top of an existing filter. |
| $\mid$              | Create a logical =or= on top of an existing filter.                      |
| =C-u -=             | Negative prefix argument, used to create a logical =not=.                |
| =~=                 | Invert the current filter built up so far.                               |
| =F v=               | Display the filter in the minibuffer.                                    |
*** Edit entries
| Shortcut | Functionality                                                                          |
|----------+----------------------------------------------------------------------------------------|
| =a=      | Add an entry.                                                                          |
| =d=      | Delete an entry from the database.                                                     |
| =k=      | Delete an entry from the database and add it to the kill ring.                         |
| =y=      | Yank an entry in the kill ring to the current database.                                |
| =m=      | Mark an entry.                                                                         |
| =C-u m=  | Unmark all the marked entries if it exists; otherwise, mark all the entries.           |
| =e=      | Enter the mode of editing the fields of the current entry.                             |
| =E=      | Edit the keyname of the current entry.                                                 |
| =H=      | Show the hidden fields of the current entry.                                           |
| =x=      | Export current or marked entries to another opened database.                           |
| =C-u x=  | Export current or marked entries to a new bib file or append them to an existing file. |
| =C k=    | Copy the entry key.                                                                    |
| =C e=    | Copy the entire entry.                                                                 |
| =C r=    | Copy a full reference.                                                                 |
| =C c=    | Copy a citation.                                                                       |
*** Reading list
| Shortcut                  | Functionality                                                                          |
|---------------------------+----------------------------------------------------------------------------------------|
| =R v=                     | View the reading list.                                                                 |
| =R a=                     | Add the current entry to the reading list.                                             |
| =R d=                     | Mark the current entry done.                                                           |
** In entry buffer
*** Navigate fields
| Shortcut    | Functionality                               |
|-------------+---------------------------------------------|
| =p= / =C-p= | Move one field up.                          |
| =n= / =C-n= | Move one field down.                        |
| =Space=     | Move to next field group.                   |
| =b=         | Move to previous field group.               |
| =g=         | Move to the first field.                    |
| =G=         | Move to the last field.                     |
| =q=         | Quit the editing mode of the current entry. |
*** Edit fields
| Shortcut      | Functionality                                           |
|---------------+---------------------------------------------------------|
| =e= / =Enter= | Edit a field value with completion.                     |
| =s=           | Enter a =@String= abbreviation as the field value.      |
| =C-u e=       | Edit a field value without completion.                  |
| =m=           | Enter multiline mode for the current field.             |
| =d=           | Delete an entry from the database.                      |
| =a=           | Add a new field.                                        |
| =c=           | Copy the content of the current field to the kill ring. |
| =k=           | Kill the content of the current field to the kill ring. |
| =y=           | Yank the content in the kill ring to the current field. |
| =r=           | Mark the field as a =special field=[fn:3].              |
** In string buffer
| Shortcut    | Functionality                     |
|-------------+-----------------------------------|
| =p= / =C-p= | Move one string up.               |
| =n= / =C-n= | Move one string down.             |
| =Space=     | Move to 10 strings down.          |
| =b=         | Move to 10 strings up.            |
| =g=         | Move to the first string.         |
| =G=         | Move to the last string.          |
| =e=         | Edit a =@String= value.           |
| =d=         | Delete a =@String= definition.    |
| =c=         | Copy a =@String= value.           |
| =x=         | Export a =@String= definition.    |
| =X=         | Export all =@String= definitions. |
