emacs_ebib.html
<div id="outline-container-orgd3a4a3b" class="outline-4">
<h4 id="orgd3a4a3b">Search/filter entries</h4>
<div class="outline-text-4" id="text-orgd3a4a3b">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/</code> / <code>ebib-search</code></td>
<td class="org-left">Search for a string or a regular expression from the current entry.</td>
</tr>

<tr>
<td class="org-left"><code>C-u /</code></td>
<td class="org-left">Start searching with the string for previous search.</td>
</tr>

<tr>
<td class="org-left"><code>&amp;</code></td>
<td class="org-left">Create a filter or perform a logical <code>and</code> on top of an existing filter.</td>
</tr>

<tr>
<td class="org-left">\(\mid\)</td>
<td class="org-left">Create a logical <code>or</code> on top of an existing filter.</td>
</tr>

<tr>
<td class="org-left"><code>C-u -</code></td>
<td class="org-left">Negative prefix argument, used to create a logical <code>not</code>.</td>
</tr>

<tr>
<td class="org-left"><code>~</code></td>
<td class="org-left">Invert the current filter built up so far.</td>
</tr>

<tr>
<td class="org-left"><code>F v</code></td>
<td class="org-left">Display the filter in the minibuffer.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8d9b78a" class="outline-4">
<h4 id="org8d9b78a">Edit entries</h4>
<div class="outline-text-4" id="text-org8d9b78a">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left">Add an entry.</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">Delete an entry from the database.</td>
</tr>

<tr>
<td class="org-left"><code>k</code></td>
<td class="org-left">Delete an entry from the database and add it to the kill ring.</td>
</tr>

<tr>
<td class="org-left"><code>y</code></td>
<td class="org-left">Yank an entry in the kill ring to the current database.</td>
</tr>

<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left">Mark an entry.</td>
</tr>

<tr>
<td class="org-left"><code>C-u m</code></td>
<td class="org-left">Unmark all the marked entries if it exists; otherwise, mark all the entries.</td>
</tr>

<tr>
<td class="org-left"><code>e</code></td>
<td class="org-left">Enter the mode of editing the fields of the current entry.</td>
</tr>

<tr>
<td class="org-left"><code>E</code></td>
<td class="org-left">Edit the keyname of the current entry.</td>
</tr>

<tr>
<td class="org-left"><code>H</code></td>
<td class="org-left">Show the hidden fields of the current entry.</td>
</tr>

<tr>
<td class="org-left"><code>x</code></td>
<td class="org-left">Export current or marked entries to another opened database.</td>
</tr>

<tr>
<td class="org-left"><code>C-u x</code></td>
<td class="org-left">Export current or marked entries to a new bib file or append them to an existing file.</td>
</tr>

<tr>
<td class="org-left"><code>C k</code></td>
<td class="org-left">Copy the entry key.</td>
</tr>

<tr>
<td class="org-left"><code>C e</code></td>
<td class="org-left">Copy the entire entry.</td>
</tr>

<tr>
<td class="org-left"><code>C r</code></td>
<td class="org-left">Copy a full reference.</td>
</tr>

<tr>
<td class="org-left"><code>C c</code></td>
<td class="org-left">Copy a citation.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7084d78" class="outline-4">
<h4 id="org7084d78">Reading list</h4>
<div class="outline-text-4" id="text-org7084d78">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>R v</code></td>
<td class="org-left">View the reading list.</td>
</tr>

<tr>
<td class="org-left"><code>R a</code></td>
<td class="org-left">Add the current entry to the reading list.</td>
</tr>

<tr>
<td class="org-left"><code>R d</code></td>
<td class="org-left">Mark the current entry done.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgde14250" class="outline-3">
<h3 id="orgde14250">In entry buffer</h3>
<div class="outline-text-3" id="text-orgde14250">
</div>
<div id="outline-container-org37f64c3" class="outline-4">
<h4 id="org37f64c3">Navigate fields</h4>
<div class="outline-text-4" id="text-org37f64c3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>p</code> / <code>C-p</code></td>
<td class="org-left">Move one field up.</td>
</tr>

<tr>
<td class="org-left"><code>n</code> / <code>C-n</code></td>
<td class="org-left">Move one field down.</td>
</tr>

<tr>
<td class="org-left"><code>Space</code></td>
<td class="org-left">Move to next field group.</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left">Move to previous field group.</td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left">Move to the first field.</td>
</tr>

<tr>
<td class="org-left"><code>G</code></td>
<td class="org-left">Move to the last field.</td>
</tr>

<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left">Quit the editing mode of the current entry.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0b243e1" class="outline-4">
<h4 id="org0b243e1">Edit fields</h4>
<div class="outline-text-4" id="text-org0b243e1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>e</code> / <code>Enter</code></td>
<td class="org-left">Edit a field value with completion.</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left">Enter a <code>@String</code> abbreviation as the field value.</td>
</tr>

<tr>
<td class="org-left"><code>C-u e</code></td>
<td class="org-left">Edit a field value without completion.</td>
</tr>

<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left">Enter multiline mode for the current field.</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">Delete an entry from the database.</td>
</tr>

<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left">Add a new field.</td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left">Copy the content of the current field to the kill ring.</td>
</tr>

<tr>
<td class="org-left"><code>k</code></td>
<td class="org-left">Kill the content of the current field to the kill ring.</td>
</tr>

<tr>
<td class="org-left"><code>y</code></td>
<td class="org-left">Yank the content in the kill ring to the current field.</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">Mark the field as a <code>special field</code><sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgeccaee6" class="outline-3">
<h3 id="orgeccaee6">In string buffer</h3>
<div class="outline-text-3" id="text-orgeccaee6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Shortcut</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>p</code> / <code>C-p</code></td>
<td class="org-left">Move one string up.</td>
</tr>

<tr>
<td class="org-left"><code>n</code> / <code>C-n</code></td>
<td class="org-left">Move one string down.</td>
</tr>

<tr>
<td class="org-left"><code>Space</code></td>
<td class="org-left">Move to 10 strings down.</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left">Move to 10 strings up.</td>
</tr>

<tr>
<td class="org-left"><code>g</code></td>
<td class="org-left">Move to the first string.</td>
</tr>

<tr>
<td class="org-left"><code>G</code></td>
<td class="org-left">Move to the last string.</td>
</tr>

<tr>
<td class="org-left"><code>e</code></td>
<td class="org-left">Edit a <code>@String</code> value.</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">Delete a <code>@String</code> definition.</td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left">Copy a <code>@String</code> value.</td>
</tr>

<tr>
<td class="org-left"><code>x</code></td>
<td class="org-left">Export a <code>@String</code> definition.</td>
</tr>

<tr>
<td class="org-left"><code>X</code></td>
<td class="org-left">Export all <code>@String</code> definitions.</td>
</tr>
</tbody>
</table>
</div>
</div>
