emacs_ebib.org
** Insert citations into a text buffer
To accommodate different modes or types of files, different citation commands are defined and can be redefined by customizing option =ebib-citation-commands=, e.g.,
- =latex-mode= a.k.a. =LaTeX-mode=
- =markdown-mode= :: =text=, =paren=, and =year=.

In practice, citations can be inserted into a text buffer in two ways below.
| Function               | Functionality                                                       |
|------------------------+---------------------------------------------------------------------|
| =ebib-insert-citation= | In a text buffer, insert one or more citations[fn:5] in the buffer. |
| =ebib-push-citation=   | In ebib index buffer, push one or more citations to a buffer.       |
** Link to external resources
- Field =file= specifies the file(s) associated to the entry. If multiple files are associated to one entry, the content of field =file= is comprised of multiple paths separated by semicolon-space (; ). Each path can be a relative path to one of the directories specfied in =ebib-file-search-dirs=.
- Shortcut =f= can make ebib search the file (indicated by field =file=) in the directories specfied in =ebib-file-search-dirs=.
- Function =ebib-download-url= can transform the content in field =url= to a link[fn:7] whereby a pdf file will be downloaded. The downloaded file is renamed[fn:6] and saved to the first directory in =ebib-file-search-dirs=.
- Function =ebib-import-file= can rename and move a local file to the first directory in =ebib-file-search-dirs=.

* Footnotes

[fn:7] The transformation rule can be customized by option =ebib-url-download-transformations=.
[fn:6] By default, the file name is the entry key appended with a =.pdf= extension. But the naming rule can be customized by option =ebib-name-transform-function=.
[fn:5] Option =ebib-citations-insert-multiple= should be set to select and insert multiple citations, in which ampersand & is used to separate two citations.
[fn:4] A =dependent database= is a database comprised of a subset of entries of a =main database=.
[fn:3] A special field is a field whose value is not surrounded by a pair of braces when the database is saved. 
[fn:2] Option =ebib-save-xrefs-first= needs to be unset first.
[fn:1] In ebib, a string of format "INDEX:BIB_FILE_NAME" is displayed in the mode line.
