emacs_ebib.html
<div id="outline-container-org5cb7410" class="outline-3">
<h3 id="org5cb7410">Insert citations into a text buffer</h3>
<div class="outline-text-3" id="text-org5cb7410">
<p>
To accommodate different modes or types of files, different citation commands are defined and can be redefined by customizing option <code>ebib-citation-commands</code>, e.g.,
</p>
<ul class="org-ul">
<li><code>latex-mode</code> a.k.a. <code>LaTeX-mode</code></li>
<li id="<code>markdown-mode</code>"><code>text</code>, <code>paren</code>, and <code>year</code>.</li>
</ul>

<p>
In practice, citations can be inserted into a text buffer in two ways below.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Functionality</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>ebib-insert-citation</code></td>
<td class="org-left">In a text buffer, insert one or more citations<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> in the buffer.</td>
</tr>

<tr>
<td class="org-left"><code>ebib-push-citation</code></td>
<td class="org-left">In ebib index buffer, push one or more citations to a buffer.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org84f80f8" class="outline-3">
<h3 id="org84f80f8">Link to external resources</h3>
<div class="outline-text-3" id="text-org84f80f8">
<ul class="org-ul">
<li>Field <code>file</code> specifies the file(s) associated to the entry. If multiple files are associated to one entry, the content of field <code>file</code> is comprised of multiple paths separated by semicolon-space (; ). Each path can be a relative path to one of the directories specfied in <code>ebib-file-search-dirs</code>.</li>
<li>Shortcut <code>f</code> can make ebib search the file (indicated by field <code>file</code>) in the directories specfied in <code>ebib-file-search-dirs</code>.</li>
<li>Function <code>ebib-download-url</code> can transform the content in field <code>url</code> to a link<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup> whereby a pdf file will be downloaded. The downloaded file is renamed<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup> and saved to the first directory in <code>ebib-file-search-dirs</code>.</li>
<li>Function <code>ebib-import-file</code> can rename and move a local file to the first directory in <code>ebib-file-search-dirs</code>.</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Option <code>ebib-save-xrefs-first</code> needs to be unset first.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
In ebib, a string of format "INDEX:BIB<sub>FILE</sub><sub>NAME</sub>" is displayed in the mode line.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A <code>dependent database</code> is a database comprised of a subset of entries of a <code>main database</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A special field is a field whose value is not surrounded by a pair of braces when the database is saved. 
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Option <code>ebib-citations-insert-multiple</code> should be set to select and insert multiple citations, in which ampersand &amp; is used to separate two citations.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The transformation rule can be customized by option <code>ebib-url-download-transformations</code>.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
By default, the file name is the entry key appended with a <code>.pdf</code> extension. But the naming rule can be customized by option <code>ebib-name-transform-function</code>.
</p></div></div>


</div>
</div></div>
</body>
</html>